Autodesk.Revit.DB.ExtensibleStorage.Field.GetSpecTypeId
Gets the spec describing the values stored in this field.
Returns:
Identifier of the spec.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.CompatibleUnit(Autodesk.Revit.DB.ForgeTypeId)
Checks if the specified unit is compatible with the field description.
unitTypeId:
The unit to check.
Returns:
True if the unit is compatible, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012